#include <iostream>
#include <cmath>

int main(){
  //1. Для введённого пользователем целого числа выдать максимальную цифру, минимальную цифру и их произведение
  
  
  
  //2. Последовательность содержит некоторое количество натуральных чисел и заканчивается числом 0 (0 не является элементом последовательности). Найти сумму вех элементов последовательности 
  //3. Дано целое число. Удалить из него заданную цифру. Например, если задано 1464235 и цифра 4, то должно получиться 16235.
  //4. Для каждого натурального числа в промежутке от N до M вывести все делители, кроме единицы и самого числа. Значения N и M вводятся с клавиатуры. 
  //5. Вывести на экран двумерную таблицу умножения.
   
  return 0;
}
