#include <iostream>
#include <cmath>
#include <string>

int main(){
  //1. Реализуйте функцию для выполнения простейшего сжатия строк с использованием счетчика повторяющихся символов. Например, строка ааbсссссааа превращается в а2b1с5а3. Если сжатая строка не становится короче исходной, то метод возвращает исходную строку. Предполагается, что строка состоит только из букв верхнего и нижнего регистра (a-z)
  
  //2. Задано целое число. Выведите его значение в текстовом виде (например, одна тысяча двести тридцать четыре).
  
  //3. Для двух строк напишите метод, определяющий, является ли одна строка перестановкой другой
   
  return 0;
}
