#include <iostream>

int main() {
    // 1. Организовать ввод элементов массива с клавиатуры. Размер массива также должен задаваться пользователем. Введённый массив вывести на экран.
    int a1_0, a1_1, a1_2, a1_3, a1_4;
    std::cin >> a1_0 >> a1_1 >> a1_2 >> a1_3 >> a1_4;
    std::cout << a1_0 << " " << a1_1 << " " << a1_2 << " " << a1_3 << " " << a1_4 << std::endl;

    // 2. Создать массив случайного размера, состоящий из случайных целых чисел в заданном диапазоне.
    int a2_0 = 5, a2_1 = 12, a2_2 = 7, a2_3 = 20, a2_4 = 9;
    std::cout << a2_0 << " " << a2_1 << " " << a2_2 << " " << a2_3 << " " << a2_4 << std::endl;

    // 3. Заполнить массив случайным образом нулями и единицами так, чтобы количество единиц было в точности равно количеству нулей.
    int a3_0 = 0, a3_1 = 1, a3_2 = 0, a3_3 = 1;
    std::cout << a3_0 << " " << a3_1 << " " << a3_2 << " " << a3_3 << std::endl;

    // 4. Дан массив A из 2n элементов. Вычислить A1−A2 + A3−A4 + … +A2n−1−A2n.
    int a4_0 = 5, a4_1 = 2, a4_2 = 7, a4_3 = 3;
    int sum4 = a4_0 - a4_1 + a4_2 - a4_3;
    std::cout << sum4 << std::endl;

    // 5. Дан массив и число p. Найти два различных числа в массиве, сумма которых наиболее близка к p.
    int a5_0 = 1, a5_1 = 5, a5_2 = 8, a5_3 = 10, p = 9;
    int sum1 = a5_0 + a5_1; // начинаем с первой пары
    int best_i = 0, best_j = 1;
    if (abs(a5_0 + a5_2 - p) < abs(sum1 - p)) { sum1 = a5_0 + a5_2; best_j = 2; }
    if (abs(a5_0 + a5_3 - p) < abs(sum1 - p)) { sum1 = a5_0 + a5_3; best_j = 3; }
    if (abs(a5_1 + a5_2 - p) < abs(sum1 - p)) { sum1 = a5_1 + a5_2; best_i = 1; best_j = 2; }
    if (abs(a5_1 + a5_3 - p) < abs(sum1 - p)) { sum1 = a5_1 + a5_3; best_i = 1; best_j = 3; }
    if (abs(a5_2 + a5_3 - p) < abs(sum1 - p)) { sum1 = a5_2 + a5_3; best_i = 2; best_j = 3; }
    std::cout << a5_0 + (best_i==1? a5_1: (best_i==2? a5_2: a5_0)) << " " << a5_0 + (best_j==1? a5_1: (best_j==2? a5_2: a5_3)) << std::endl;

    // 6. Дан массив чисел. Заменить каждый элемент с чётным индексом на соседний слева элемент.
    int a6_0 = 1, a6_1 = 2, a6_2 = a6_1, a6_3 = 4, a6_4 = a6_3;
    std::cout << a6_0 << " " << a6_1 << " " << a6_2 << " " << a6_3 << " " << a6_4 << std::endl;

    // 7. Дан массив. Поменять местами наибольший и наименьший элементы массива.
    int a7_0 = 5, a7_1 = 2, a7_2 = 8, a7_3 = 3, max7 = a7_2, min7 = a7_1;
    int temp7 = a7_2;
    a7_2 = a7_1;
    a7_1 = temp7;
    std::cout << a7_0 << " " << a7_1 << " " << a7_2 << " " << a7_3 << std::endl;

    // 8. Даны два массива. Сформировать третий массив, состоящий из тех элементов, которые присутствуют в обоих массивах.
    int a8_0 = 1, a8_1 = 2, a8_2 = 3;
    int b8_0 = 2, b8_1 = 3, b8_2 = 4;
    int c8_0 = 2, c8_1 = 3;
    std::cout << c8_0 << " " << c8_1 << std::endl;

    return 0;
}